SpenceKonde/megaTinyCore/megaavr/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification


menu.chip=Chip
menu.bodvoltage=BOD Voltage
menu.bodmodeactive=BOD Mode (active)
menu.bodmodesleep=BOD Mode (sleep)
menu.eesave=Save EEPROM
menu.clock=Clock Speed
menu.clocksource=Clock Source
menu.millis=millis()/micros()
menu.uartvoltage=Voltage for UART baud calc)
menu.resetpin=UPDI/reset pin
menu.bootloaderuart=UART for Bootloader



##############################################################

atxy7.name=ATtiny3217/1617/1607/817/807/417
atxy7.upload.workaround=
atxy7.build.defaultmillistimer=D0
atxy7.build.bootload=
atxy7.build.mcu=attiny{build.attiny}
atxy7.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy7.build.f_cpu={build.speed}000000L

atxy7.menu.chip.3217=ATtiny3217
atxy7.menu.chip.3217.build.attiny=3217
atxy7.menu.chip.3217.upload.maximum_size=32768
atxy7.menu.chip.3217.upload.maximum_data_size=2048
atxy7.menu.chip.1617=ATtiny1617
atxy7.menu.chip.1617.build.attiny=1617
atxy7.menu.chip.1617.upload.maximum_size=16384
atxy7.menu.chip.1617.upload.maximum_data_size=2048
atxy7.menu.chip.817=ATtiny817
atxy7.menu.chip.817.build.attiny=817
atxy7.menu.chip.817.upload.maximum_size=8192
atxy7.menu.chip.817.upload.maximum_data_size=512
atxy7.menu.chip.417=ATtiny417
atxy7.menu.chip.417.build.attiny=417
atxy7.menu.chip.417.upload.maximum_size=4096
atxy7.menu.chip.417.upload.maximum_data_size=256
atxy7.menu.chip.1607=ATtiny1607
atxy7.menu.chip.1607.build.attiny=1607
atxy7.menu.chip.1607.build.defaultmillistimer=A0
atxy7.menu.chip.1607.upload.maximum_size=16384
atxy7.menu.chip.1607.upload.maximum_data_size=1024
atxy7.menu.chip.807=ATtiny807
atxy7.menu.chip.807.build.attiny=807
atxy7.menu.chip.807.build.defaultmillistimer=A0
atxy7.menu.chip.807.upload.maximum_size=8192
atxy7.menu.chip.807.upload.maximum_data_size=512

atxy7.menu.clock.20=20 MHz
atxy7.menu.clock.16=16 MHz
atxy7.menu.clock.10=10 MHz
atxy7.menu.clock.8=8 MHz
atxy7.menu.clock.5=5 MHz
atxy7.menu.clock.4=4 MHz
atxy7.menu.clock.1=1 MHz
atxy7.menu.clock.20.build.speed=20
atxy7.menu.clock.16.build.speed=16
atxy7.menu.clock.10.build.speed=10
atxy7.menu.clock.8.build.speed=8
atxy7.menu.clock.5.build.speed=5
atxy7.menu.clock.4.build.speed=4
atxy7.menu.clock.1.build.speed=1
atxy7.menu.clock.20.bootloader.OSCCFG=0x02
atxy7.menu.clock.16.bootloader.OSCCFG=0x01
atxy7.menu.clock.10.bootloader.OSCCFG=0x02
atxy7.menu.clock.8.bootloader.OSCCFG=0x01
atxy7.menu.clock.5.bootloader.OSCCFG=0x02
atxy7.menu.clock.4.bootloader.OSCCFG=0x01
atxy7.menu.clock.1.bootloader.OSCCFG=0x01

atxy7.menu.bodvoltage.1v8=1.8V
atxy7.menu.bodvoltage.2v6=2.6V
atxy7.menu.bodvoltage.4v2=4.2V
atxy7.menu.bodvoltage.2v1=2.1V
atxy7.menu.bodvoltage.2v9=2.9V
atxy7.menu.bodvoltage.3v3=3.3V
atxy7.menu.bodvoltage.3v7=3.7V
atxy7.menu.bodvoltage.4v0=4.0V

atxy7.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7.menu.bodvoltage.2v1=2.1V (unofficial)
atxy7.menu.bodvoltage.2v9=2.9V (unofficial)
atxy7.menu.bodvoltage.3v3=3.3V (unofficial)
atxy7.menu.bodvoltage.3v7=3.7V (unofficial)
atxy7.menu.bodvoltage.4v0=4.0V (unofficial)
atxy7.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy7.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy7.menu.bodmodeactive.disabled=Disabled
atxy7.menu.bodmodeactive.enabled=Enabled
atxy7.menu.bodmodeactive.sampled=Sampled
atxy7.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy7.menu.bodmodesleep.disabled=Disabled
atxy7.menu.bodmodesleep.enabled=Enabled
atxy7.menu.bodmodesleep.sampled=Sampled
atxy7.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy7.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy7.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy7.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy7.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy7.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy7.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


atxy7.menu.eesave.enable=EEPROM retained
atxy7.menu.eesave.enable.bootloader.SYSCFG0=0xC7
atxy7.menu.eesave.disable=EEPROM not retained
atxy7.menu.eesave.disable.bootloader.SYSCFG0=0xC6


atxy7.menu.millis.enabled=Enabled (default timer)
atxy7.menu.millis.disabled=Disabled (saves flash)
atxy7.menu.millis.timera=TCA0 (default on 0-series)
atxy7.menu.millis.timerd=TCD0 (1-series only, default there)
atxy7.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy7.menu.millis.timerb1=TCB1 (3217,1617 only)
atxy7.menu.millis.rtc=RTC (no micros)
atxy7.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
atxy7.menu.millis.enabled.build.millistimer={build.defaultmillistimer}
atxy7.menu.millis.disabled.build.millistimer=NONE
atxy7.menu.millis.timera.build.millistimer=A0
atxy7.menu.millis.timerd.build.millistimer=D0
atxy7.menu.millis.timerb0.build.millistimer=B0
atxy7.menu.millis.timerb1.build.millistimer=B1
atxy7.menu.millis.rtc.build.millistimer=RTC
atxy7.menu.millis.rtcxtal.build.millistimer=RTC_XTAL


atxy7.menu.uartvoltage.5v=Closer to 5v
atxy7.menu.uartvoltage.3v=Closer to 3v
atxy7.menu.uartvoltage.5v.build.uartvoltage=5V
atxy7.menu.uartvoltage.3v.build.uartvoltage=3V


atxy7.upload.tool=avrdude

atxy7.build.board=attinyxy7
atxy7.build.core=arduino
atxy7.build.variant=txy7
atxy7.build.text_section_start=.text=0x0
atxy7.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM -DUARTBAUD{build.uartvoltage}
atxy7.build.export_merged_output=false

atxy7.bootloader.tool=avrdude
atxy7.bootloader.WDTCFG=0x00
atxy7.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy7.bootloader.TCD0CFG=0x00
atxy7.bootloader.SYSCFG1=0x03
atxy7.bootloader.APPEND=0x00
atxy7.bootloader.BOOTEND=0x00

atxy7.bootloader.flashcommand=

