SpenceKonde/megaTinyCore/megaavr/boards.txt
Xplained416.menu.millis.enabled=Enabled (default timer)
Xplained416.menu.millis.disabled=Disabled (saves flash)
Xplained416.menu.millis.timera=TCA0
Xplained416.menu.millis.timerd=TCD0 (default)
Xplained416.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
Xplained416.menu.millis.enabled.build.millistimer=D0
Xplained416.menu.millis.rtc=RTC (no micros)
Xplained416.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
Xplained416.menu.millis.disabled.build.millistimer=NONE
Xplained416.menu.millis.timera.build.millistimer=A0
Xplained416.menu.millis.timerd.build.millistimer=D0
Xplained416.menu.millis.timerb0.build.millistimer=B0
Xplained416.menu.millis.rtc.build.millistimer=RTC
Xplained416.menu.millis.rtcxtal.build.millistimer=RTC_XTAL

Xplained416.menu.uartvoltage.5v=Closer to 5v
Xplained416.menu.uartvoltage.3v=Closer to 3v
Xplained416.menu.uartvoltage.5v.build.uartvoltage=5V
Xplained416.menu.uartvoltage.3v.build.uartvoltage=3V



Xplained817.name=Attiny817 Xplained Mini (optiboot)
Xplained817.upload.workaround=
Xplained817.build.defaultmillistimer=D0
Xplained817.build.bootload=opti
Xplained817.build.mcu=attiny{build.attiny}
Xplained817.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
Xplained817.build.f_cpu={build.speed}000000L


Xplained817.build.attiny=817
Xplained817.build.board=attinyxy7
Xplained817.build.core=arduino
Xplained817.build.variant=txy7
Xplained817.build.speed=20
Xplained817.build.text_section_start=.text=0x200
Xplained817.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM -DUARTBAUD{build.uartvoltage}
Xplained817.upload.tool=avrdude
Xplained817.upload.speed=57600
Xplained817.upload.maximum_size=7680
Xplained817.upload.maximum_data_size=512
Xplained817.upload.protocol=arduino
Xplained817.upload.extra_params=-D
Xplained817.bootloader.file=optiboot_x/optiboot_xplained817.hex
Xplained817.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained817.bootloader.tool=avrdude
Xplained817.bootloader.BOOTEND=0x2
Xplained817.bootloader.OSCCFG=0x02
Xplained817.bootloader.WDTCFG=0x00
Xplained817.bootloader.BODCFG=0b00000000
Xplained817.bootloader.TCD0CFG=0x00
Xplained817.bootloader.SYSCFG0=0xC9
Xplained817.bootloader.SYSCFG1=0x03
Xplained817.bootloader.APPEND=0x00



Xplained817.menu.millis.enabled=Enabled (default timer)
Xplained817.menu.millis.disabled=Disabled (saves flash)
Xplained817.menu.millis.timera=TCA0
Xplained817.menu.millis.timerd=TCD0 (default)
Xplained817.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
Xplained817.menu.millis.rtc=RTC (no micros)
Xplained817.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
Xplained817.menu.millis.enabled.build.millistimer=D0
Xplained817.menu.millis.disabled.build.millistimer=NONE
Xplained817.menu.millis.timera.build.millistimer=A0
Xplained817.menu.millis.timerd.build.millistimer=D0
Xplained817.menu.millis.timerb0.build.millistimer=B0
Xplained817.menu.millis.rtc.build.millistimer=RTC
Xplained817.menu.millis.rtcxtal.build.millistimer=RTC_XTAL


Xplained817.menu.uartvoltage.5v=Closer to 5v
Xplained817.menu.uartvoltage.3v=Closer to 3v
Xplained817.menu.uartvoltage.5v.build.uartvoltage=5V
Xplained817.menu.uartvoltage.3v.build.uartvoltage=3V


# Separate board types for chips with Optiboot.  Reduces menu clutter.

atxy7o.name=ATtiny3217/1617/1607/817/807/417 (Optiboot)
atxy7o.upload.workaround=
atxy7o.build.defaultmillistimer=D0
atxy7o.build.bootload=opti
atxy7o.build.mcu=attiny{build.attiny}
atxy7o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy7o.build.f_cpu={build.speed}000000L
atxy7o.upload.speed=115200



atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.attiny=3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.attiny=1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.attiny=817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.attiny=417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.attiny=1607
atxy7o.menu.chip.1607.build.defaultmillistimer=A0
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.attiny=807
atxy7o.menu.chip.807.build.defaultmillistimer=A0
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512

atxy7o.menu.clock.20=20 MHz
atxy7o.menu.clock.16=16 MHz
atxy7o.menu.clock.10=10 MHz
atxy7o.menu.clock.8=8 MHz
atxy7o.menu.clock.5=5 MHz
atxy7o.menu.clock.4=4 MHz
atxy7o.menu.clock.1=1 MHz
atxy7o.menu.clock.20.build.speed=20
atxy7o.menu.clock.16.build.speed=16
atxy7o.menu.clock.10.build.speed=10
atxy7o.menu.clock.8.build.speed=8
atxy7o.menu.clock.5.build.speed=5
atxy7o.menu.clock.4.build.speed=4
atxy7o.menu.clock.1.build.speed=1
atxy7o.menu.clock.20.bootloader.OSCCFG=0x02
atxy7o.menu.clock.16.bootloader.OSCCFG=0x01
atxy7o.menu.clock.10.bootloader.OSCCFG=0x02
atxy7o.menu.clock.8.bootloader.OSCCFG=0x01
atxy7o.menu.clock.5.bootloader.OSCCFG=0x02
atxy7o.menu.clock.4.bootloader.OSCCFG=0x01
atxy7o.menu.clock.1.bootloader.OSCCFG=0x01

atxy7o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7o.menu.bodvoltage.2v1=2.1V (unofficial)
atxy7o.menu.bodvoltage.2v9=2.9V (unofficial)
atxy7o.menu.bodvoltage.3v3=3.3V (unofficial)
atxy7o.menu.bodvoltage.3v7=3.7V (unofficial)
atxy7o.menu.bodvoltage.4v0=4.0V (unofficial)
atxy7o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy7o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy7o.menu.bodmodeactive.disabled=Disabled
atxy7o.menu.bodmodeactive.enabled=Enabled
atxy7o.menu.bodmodeactive.sampled=Sampled
atxy7o.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy7o.menu.bodmodesleep.disabled=Disabled
atxy7o.menu.bodmodesleep.enabled=Enabled
atxy7o.menu.bodmodesleep.sampled=Sampled
atxy7o.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy7o.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy7o.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy7o.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy7o.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy7o.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy7o.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


