SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy7o.menu.millis.enabled=Enabled (default timer)
atxy7o.menu.millis.disabled=Disabled (saves flash)
atxy7o.menu.millis.timera=TCA0 (default on 0-series)
atxy7o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy7o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy7o.menu.millis.timerb1=TCB1 (3217,1617 only)
atxy7o.menu.millis.rtc=RTC (no micros)
atxy7o.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
atxy7o.menu.millis.enabled.build.millistimer={build.defaultmillistimer}
atxy7o.menu.millis.disabled.build.millistimer=NONE
atxy7o.menu.millis.timera.build.millistimer=A0
atxy7o.menu.millis.timerd.build.millistimer=D0
atxy7o.menu.millis.timerb0.build.millistimer=B0
atxy7o.menu.millis.timerb1.build.millistimer=B1
atxy7o.menu.millis.rtc.build.millistimer=RTC
atxy7o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL


atxy7o.menu.resetpin.UPDI=UPDI (powercycle to enter bootloader)
atxy7o.menu.resetpin.UPDI.bootloader.file=optiboot_x/optiboot_txy7{bootloader.uartswap}.hex
atxy7o.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy7o.menu.resetpin.reset=Reset (DANGER - Read docs first!)
atxy7o.menu.resetpin.reset.bootloader.file=optiboot_x/optiboot_txy7{bootloader.uartswap}_rst.hex
atxy7o.menu.resetpin.reset.bootloader.resetpinbits=10
atxy7o.menu.resetpin.gpio=IO (DANGER - Read docs first! powercycle to enter bootloader)
atxy7o.menu.resetpin.gpio.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy7o.menu.resetpin.gpio.bootloader.resetpinbits=00

atxy7o.menu.uartvoltage.5v=Closer to 5v
atxy7o.menu.uartvoltage.3v=Closer to 3v
atxy7o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy7o.menu.uartvoltage.3v.build.uartvoltage=3V

atxy7o.menu.bootloaderuart.default=TX:9, RX:8
atxy7o.menu.bootloaderuart.alternate=TX:18, RX:19
atxy7o.menu.bootloaderuart.default.bootloader.uartswap=
atxy7o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

atxy7o.upload.tool=avrdude

atxy7o.build.board=attinyxy7
atxy7o.build.core=arduino
atxy7o.build.variant=txy7
atxy7o.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM -DUARTBAUD{build.uartvoltage}
atxy7o.build.export_merged_output=true

atxy7o.bootloader.WDTCFG=0x00
atxy7o.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy7o.bootloader.TCD0CFG=0x00
atxy7o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy7o.bootloader.SYSCFG1=0x03
atxy7o.bootloader.APPEND=0x00
atxy7o.bootloader.BOOTEND=0x02



atxy7o.upload.protocol=arduino
atxy7o.upload.extra_params=-D
atxy7o.build.text_section_start=.text=0x200
atxy7o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy7o.bootloader.tool=avrdude

##############################################################

atxy6o.name=ATtiny3216/1616/1606/816/806/416/406 (optiboot)
atxy6o.upload.workaround=
atxy6o.build.defaultmillistimer=D0
atxy6o.build.bootload=opti
atxy6o.build.mcu=attiny{build.attiny}
atxy6o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy6o.build.f_cpu={build.speed}000000L
atxy6o.upload.speed=115200



atxy6o.menu.chip.3216=ATtiny3216
atxy6o.menu.chip.3216.build.attiny=3216
atxy6o.menu.chip.3216.upload.maximum_size=32768
atxy6o.menu.chip.3216.upload.maximum_data_size=2048
atxy6o.menu.chip.1616=ATtiny1616
atxy6o.menu.chip.1616.build.attiny=1616
atxy6o.menu.chip.1616.upload.maximum_size=16384
atxy6o.menu.chip.1616.upload.maximum_data_size=2048
atxy6o.menu.chip.816=ATtiny816
atxy6o.menu.chip.816.build.attiny=816
atxy6o.menu.chip.816.upload.maximum_size=8192
atxy6o.menu.chip.816.upload.maximum_data_size=512
atxy6o.menu.chip.416=ATtiny416
atxy6o.menu.chip.416.build.attiny=416
atxy6o.menu.chip.416.upload.maximum_size=4096
atxy6o.menu.chip.416.upload.maximum_data_size=256

atxy6o.menu.chip.1606=ATtiny1606
atxy6o.menu.chip.1606.build.attiny=1606
atxy6o.menu.chip.1606.build.defaultmillistimer=A0
atxy6o.menu.chip.1606.upload.maximum_size=16384
atxy6o.menu.chip.1606.upload.maximum_data_size=1024
atxy6o.menu.chip.806=ATtiny806
atxy6o.menu.chip.806.build.attiny=806
atxy6o.menu.chip.806.build.defaultmillistimer=A0
atxy6o.menu.chip.806.upload.maximum_size=8192
atxy6o.menu.chip.806.upload.maximum_data_size=512
atxy6o.menu.chip.406=ATtiny406
atxy6o.menu.chip.406.build.attiny=406
atxy6o.menu.chip.406.build.defaultmillistimer=A0
atxy6o.menu.chip.406.upload.maximum_size=4096
atxy6o.menu.chip.406.upload.maximum_data_size=256

atxy6o.menu.clock.20=20 MHz
atxy6o.menu.clock.16=16 MHz
atxy6o.menu.clock.10=10 MHz
atxy6o.menu.clock.8=8 MHz
atxy6o.menu.clock.5=5 MHz
atxy6o.menu.clock.4=4 MHz
atxy6o.menu.clock.1=1 MHz
atxy6o.menu.clock.20.build.speed=20
atxy6o.menu.clock.16.build.speed=16
atxy6o.menu.clock.10.build.speed=10
atxy6o.menu.clock.8.build.speed=8
atxy6o.menu.clock.5.build.speed=5
atxy6o.menu.clock.4.build.speed=4
atxy6o.menu.clock.1.build.speed=1
atxy6o.menu.clock.20.bootloader.OSCCFG=0x02
atxy6o.menu.clock.16.bootloader.OSCCFG=0x01
atxy6o.menu.clock.10.bootloader.OSCCFG=0x02
atxy6o.menu.clock.8.bootloader.OSCCFG=0x01
atxy6o.menu.clock.5.bootloader.OSCCFG=0x02
atxy6o.menu.clock.4.bootloader.OSCCFG=0x01
atxy6o.menu.clock.1.bootloader.OSCCFG=0x01


atxy6o.menu.millis.enabled=Enabled (default timer)
atxy6o.menu.millis.disabled=Disabled (saves flash)
atxy6o.menu.millis.timera=TCA0 (default on 0-series)
atxy6o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy6o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy6o.menu.millis.timerb1=TCB1 (3216,1616 only)
atxy6o.menu.millis.rtc=RTC (no micros)
atxy6o.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
atxy6o.menu.millis.enabled.build.millistimer={build.defaultmillistimer}
atxy6o.menu.millis.disabled.build.millistimer=NONE
atxy6o.menu.millis.timera.build.millistimer=A0
atxy6o.menu.millis.timerd.build.millistimer=D0
atxy6o.menu.millis.timerb0.build.millistimer=B0
atxy6o.menu.millis.timerb1.build.millistimer=B1
atxy6o.menu.millis.rtc.build.millistimer=RTC
atxy6o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL


atxy6o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy6o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy6o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy6o.menu.bodvoltage.2v1=2.1V (unofficial)
atxy6o.menu.bodvoltage.2v9=2.9V (unofficial)
atxy6o.menu.bodvoltage.3v3=3.3V (unofficial)
atxy6o.menu.bodvoltage.3v7=3.7V (unofficial)
atxy6o.menu.bodvoltage.4v0=4.0V (unofficial)
atxy6o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy6o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy6o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy6o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy6o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy6o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy6o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy6o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy6o.menu.bodmodeactive.disabled=Disabled
atxy6o.menu.bodmodeactive.enabled=Enabled
atxy6o.menu.bodmodeactive.sampled=Sampled
atxy6o.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy6o.menu.bodmodesleep.disabled=Disabled
atxy6o.menu.bodmodesleep.enabled=Enabled
atxy6o.menu.bodmodesleep.sampled=Sampled
atxy6o.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy6o.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy6o.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy6o.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy6o.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy6o.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy6o.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy6o.menu.uartvoltage.5v=Closer to 5v
atxy6o.menu.uartvoltage.3v=Closer to 3v
atxy6o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy6o.menu.uartvoltage.3v.build.uartvoltage=3V


