SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy4o.menu.bootloaderuart.default=TX:5, RX:4
atxy4o.menu.bootloaderuart.alternate=TX:8, RX:9
atxy4o.menu.bootloaderuart.default.bootloader.uartswap=
atxy4o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt


atxy4o.bootloader.WDTCFG=0x00
atxy4o.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy4o.bootloader.TCD0CFG=0x00
atxy4o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy4o.bootloader.SYSCFG1=0x03
atxy4o.bootloader.APPEND=0x00
atxy4o.bootloader.BOOTEND=0x02

atxy4o.menu.resetpin.UPDI=UPDI (powercycle to enter bootloader)
atxy4o.menu.resetpin.UPDI.bootloader.file=optiboot_x/optiboot_txy4{bootloader.uartswap}.hex
atxy4o.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy4o.menu.resetpin.reset=Reset (DANGER - Read docs first!)
atxy4o.menu.resetpin.reset.bootloader.file=optiboot_x/optiboot_txy4{bootloader.uartswap}_rst.hex
atxy4o.menu.resetpin.reset.bootloader.resetpinbits=10
atxy4o.menu.resetpin.gpio=IO (DANGER - Read docs first! powercycle to enter bootloader)
atxy4o.menu.resetpin.gpio.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy4o.menu.resetpin.gpio.bootloader.resetpinbits=00


##############################################################

atxy2o.name=ATtiny412/402/212/202 (optiboot)
atxy2o.upload.workaround=
atxy2o.build.defaultmillistimer=D0
atxy2o.build.bootload=opti
atxy2o.build.mcu=attiny{build.attiny}
atxy2o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy2o.build.f_cpu={build.speed}000000L
atxy2o.upload.speed=115200



#atxy2o.menu.chip.812=ATtiny812
#atxy2o.menu.chip.812.build.attiny=812
#atxy2o.menu.chip.812.upload.maximum_size=8192
#atxy2o.menu.chip.812.upload.maximum_data_size=512
atxy2o.menu.chip.412=ATtiny412
atxy2o.menu.chip.412.build.attiny=412
atxy2o.menu.chip.412.upload.maximum_size=4096
atxy2o.menu.chip.412.upload.maximum_data_size=256
atxy2o.menu.chip.212=ATtiny212
atxy2o.menu.chip.212.build.attiny=212
atxy2o.menu.chip.212.upload.maximum_size=2048
atxy2o.menu.chip.212.upload.maximum_data_size=128
#atxy2o.menu.chip.802=ATtiny802
#atxy2o.menu.chip.802.build.attiny=802
#atxy2o.menu.chip.802.build.defaultmillistimer=A0
#atxy2o.menu.chip.802.upload.maximum_size=8192
#atxy2o.menu.chip.802.upload.maximum_data_size=512
atxy2o.menu.chip.402=ATtiny402
atxy2o.menu.chip.402.build.attiny=402
atxy2o.menu.chip.402.build.defaultmillistimer=A0
atxy2o.menu.chip.402.upload.maximum_size=4096
atxy2o.menu.chip.402.upload.maximum_data_size=256
atxy2o.menu.chip.402w=ATtiny402 (bad signature)
atxy2o.menu.chip.402w.build.attiny=402
atxy2o.menu.chip.402w.build.defaultmillistimer=A0
atxy2o.menu.chip.402w.upload.maximum_size=4096
atxy2o.menu.chip.402w.upload.maximum_data_size=256
atxy2o.menu.chip.402w.upload.workaround=w
atxy2o.menu.chip.202=ATtiny202
atxy2o.menu.chip.202.build.attiny=202
atxy2o.menu.chip.202.build.defaultmillistimer=A0
atxy2o.menu.chip.202.upload.maximum_size=2048
atxy2o.menu.chip.202.upload.maximum_data_size=128

atxy2o.menu.clock.20=20 MHz
atxy2o.menu.clock.16=16 MHz
atxy2o.menu.clock.10=10 MHz
atxy2o.menu.clock.8=8 MHz
atxy2o.menu.clock.5=5 MHz
atxy2o.menu.clock.4=4 MHz
atxy2o.menu.clock.1=1 MHz
atxy2o.menu.clock.20.build.speed=20
atxy2o.menu.clock.16.build.speed=16
atxy2o.menu.clock.10.build.speed=10
atxy2o.menu.clock.8.build.speed=8
atxy2o.menu.clock.5.build.speed=5
atxy2o.menu.clock.4.build.speed=4
atxy2o.menu.clock.1.build.speed=1
atxy2o.menu.clock.20.bootloader.OSCCFG=0x02
atxy2o.menu.clock.16.bootloader.OSCCFG=0x01
atxy2o.menu.clock.10.bootloader.OSCCFG=0x02
atxy2o.menu.clock.8.bootloader.OSCCFG=0x01
atxy2o.menu.clock.5.bootloader.OSCCFG=0x02
atxy2o.menu.clock.4.bootloader.OSCCFG=0x01
atxy2o.menu.clock.1.bootloader.OSCCFG=0x01


atxy2o.menu.millis.enabled=Enabled (default timer)
atxy2o.menu.millis.disabled=Disabled (saves flash)
atxy2o.menu.millis.timera=TCA0 (default on 402/202)
atxy2o.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2o.menu.millis.rtc=RTC (no micros)
atxy2o.menu.millis.enabled.build.millistimer={build.defaultmillistimer}
atxy2o.menu.millis.disabled.build.millistimer=NONE
atxy2o.menu.millis.timera.build.millistimer=A0
atxy2o.menu.millis.timerd.build.millistimer=D0
atxy2o.menu.millis.timerb0.build.millistimer=B0
atxy2o.menu.millis.rtc.build.millistimer=RTC

atxy2o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy2o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy2o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy2o.menu.bodvoltage.2v1=2.1V (unofficial)
atxy2o.menu.bodvoltage.2v9=2.9V (unofficial)
atxy2o.menu.bodvoltage.3v3=3.3V (unofficial)
atxy2o.menu.bodvoltage.3v7=3.7V (unofficial)
atxy2o.menu.bodvoltage.4v0=4.0V (unofficial)
atxy2o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy2o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy2o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy2o.menu.bodmodeactive.disabled=Disabled
atxy2o.menu.bodmodeactive.enabled=Enabled
atxy2o.menu.bodmodeactive.sampled=Sampled
atxy2o.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy2o.menu.bodmodesleep.disabled=Disabled
atxy2o.menu.bodmodesleep.enabled=Enabled
atxy2o.menu.bodmodesleep.sampled=Sampled
atxy2o.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy2o.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy2o.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy2o.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy2o.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy2o.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy2o.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy2o.menu.bootloaderuart.default=TX:0 (PA6), RX:1 (PA7)
atxy2o.menu.bootloaderuart.alternate=TX:2 (PA1), RX:3 (PA2)
atxy2o.menu.bootloaderuart.default.bootloader.uartswap=
atxy2o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt


atxy2o.upload.tool=avrdude
atxy2o.upload.protocol=arduino
atxy2o.upload.extra_params=-D
atxy2o.build.text_section_start=.text=0x200
atxy2o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy2o.bootloader.tool=avrdude

atxy2o.build.board=attinyxy2
atxy2o.build.core=arduino
atxy2o.build.variant=txy2
atxy2o.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP -DNEOPIXELPORT=VPORTA.OUT -DUARTBAUD{build.uartvoltage}
atxy2o.build.export_merged_output=true

atxy2o.menu.uartvoltage.5v=Closer to 5v
atxy2o.menu.uartvoltage.3v=Closer to 3v
atxy2o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy2o.menu.uartvoltage.3v.build.uartvoltage=3V



atxy2o.bootloader.WDTCFG=0x00
atxy2o.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy2o.bootloader.TCD0CFG=0x00
atxy2o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy2o.bootloader.SYSCFG1=0x03
atxy2o.bootloader.APPEND=0x00
atxy2o.bootloader.BOOTEND=0x02

atxy2o.menu.resetpin.UPDI=UPDI (powercycle to enter bootloader)
atxy2o.menu.resetpin.UPDI.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy2o.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy2o.menu.resetpin.reset=Reset (DANGER - Read docs first!)
atxy2o.menu.resetpin.reset.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}_rst.hex
atxy2o.menu.resetpin.reset.bootloader.resetpinbits=10
atxy2o.menu.resetpin.gpio=IO (DANGER - Read docs first! powercycle to enter bootloader)
atxy2o.menu.resetpin.gpio.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy2o.menu.resetpin.gpio.bootloader.resetpinbits=00
